---
kind: method
id: M:Autodesk.Revit.DB.ContourSetting.Dispose
source: html/08e03992-6f18-5bd8-347c-38fba3f4a1f4.htm
---
# Autodesk.Revit.DB.ContourSetting.Dispose Method

Releases all resources used by the ContourSetting

## Syntax (C#)
```csharp
public void Dispose()
```